---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
source: html/7e77c25f-9467-2143-dc2b-ee926a7391e4.htm
---
# AssetPropertyDoubleArray4d Members

Adds a new connected asset attached to this asset property, if it allows it.